Revit 2024 API
GroupSet.Erase Method
Removes a specified group from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	Group item
)
Visual Basic
Public Overridable Function Erase ( _
	item As Group _
) As Integer
Visual C++
public:
virtual int Erase(
	Group^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Group
The group to be erased.
Return Value
The number of groups that were erased from the set.
See Also
GroupSet Class
Autodesk.Revit.DB Namespace